## Plan Result (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/198472)



<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_event_rule.corpus-events_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_367E1F16
  * aws_cloudwatch_event_target.corpus-events_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-CorpusEvents-Event-SNS-Target_8E7F60FE
  * aws_cloudwatch_metric_alarm.corpus-events_corpusevents-rule-dlq-alarm_F25C8DC2
  * aws_sns_topic.corpus-events_corpusevents-event-topic_7052C84E
  * aws_sns_topic_policy.corpus-events_corpusevents-events-sns-topic-policy_0349C2C5
  * aws_sqs_queue.corpus-events_sns-topic-dlq_2C473ED0
  * null_resource.corpus-events_null-resource_2F3E192D



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.corpus-events_PocketEventBridge-Prod-CorpusEvents-SNS-Policy_831D68A5 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "corpus-events_PocketEventBridge-Prod-CorpusEvents-SNS-Policy_831D68A5" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.corpus-events_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_367E1F16 will be created
  + resource "aws_cloudwatch_event_rule" "corpus-events_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_367E1F16" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "update-approved-item",
                  + "add-approved-item",
                ]
              + source      = [
                  + "curation-migration-datasync",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-CorpusEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_target.corpus-events_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-CorpusEvents-Event-SNS-Target_8E7F60FE will be created
  + resource "aws_cloudwatch_event_target" "corpus-events_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-CorpusEvents-Event-SNS-Target_8E7F60FE" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "PocketEventBridge-Prod-CorpusEvents-Rule-Rule"
      + target_id      = "PocketEventBridge-Prod-CorpusEvents-Event-SNS-Target"

      + dead_letter_config {
          + arn = (known after apply)
        }
    }

  # aws_cloudwatch_metric_alarm.corpus-events_corpusevents-rule-dlq-alarm_F25C8DC2 will be created
  + resource "aws_cloudwatch_metric_alarm" "corpus-events_corpusevents-rule-dlq-alarm_F25C8DC2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ]
      + alarm_description                     = "Number of messages >= 10"
      + alarm_name                            = "PocketEventBridge-Prod-CorpusEvents-Rule-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "PocketEventBridge-Prod-SNS-CorpusEvents-Topic-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 4
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.corpus-events_corpusevents-event-topic_7052C84E will be created
  + resource "aws_sns_topic" "corpus-events_corpusevents-event-topic_7052C84E" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "PocketEventBridge-Prod-CorpusEventsTopic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.corpus-events_corpusevents-events-sns-topic-policy_0349C2C5 will be created
  + resource "aws_sns_topic_policy" "corpus-events_corpusevents-events-sns-topic-policy_0349C2C5" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sqs_queue.corpus-events_sns-topic-dlq_2C473ED0 will be created
  + resource "aws_sqs_queue" "corpus-events_sns-topic-dlq_2C473ED0" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-CorpusEvents-Topic-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # null_resource.corpus-events_null-resource_2F3E192D will be created
  + resource "null_resource" "corpus-events_null-resource_2F3E192D" {
      + id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"362a35d4-0fd9-454f-8ae5-b0fdc2e6b4a4","JobName":"pocket-event-bridge_infrastructure_plan_prod","PRNumber":575,"Program":"tfcmt","SHA1":"34845069880137ad87b9003b368c58f7149defb8","Target":"pocket-event-bridge-cdk","Vars":{}} -->